In [1]:
import pandas as pd
from pathlib import Path
import json

In [2]:
#Create path for .csv file

filename = Path("used_car_sales.csv")

In [3]:
ModelandMake_df = pd.read_csv(filename)
ModelandMake_df.head()

,ID,pricesold,yearsold,zipcode,Mileage,Make,Model,Year,Trim,Engine,BodyType,NumCylinders,DriveType
0,18489,2200,2019,32804,120583,300,CHRYSLER,2006,LIMITED,V-6,SEDAN,6,RWD
1,45848,6200,2019,11727,46292,2101,NaN,1977,NaN,NaN,Sedan,4,RWD
2,11937,13000,2019,89060,73000,1964 International,Scout 80,1964,NaN,stock,SUV,4,4WD
3,20524,98000,2019,70118,3568,AC,AUTOKRAFT MK IV,1988,AK1269 ALUMINUM BODY,302 HO,ALUMINUM,0,ROADSTER
4,3285,7900,2019,35565,100,AC Cobra,NaN,1965,NaN,V8,NaN,0,NaN

In [4]:
ModelandMake_df.columns

Index(['ID', 'pricesold', 'yearsold', 'zipcode', 'Mileage', 'Make', 'Model',
       'Year', 'Trim', 'Engine', 'BodyType', 'NumCylinders', 'DriveType'],
      dtype='object')

In [5]:
ModelandMake_df.drop(['ID', 'pricesold', 'yearsold', 'Mileage', 'Year', 'Trim', 'Engine', 'BodyType', 'NumCylinders', 'DriveType','zipcode'], axis=1, inplace=True)

In [6]:
ModelandMake_df.head()

                 Make            Model
0                 300         CHRYSLER
1                2101              NaN
2  1964 International         Scout 80
3                  AC  AUTOKRAFT MK IV
4            AC Cobra              NaN

In [7]:
ModelandMake_df.dropna(subset=['Make', 'Model'], inplace=True)

In [8]:
ModelandMake_df.head()

                 Make            Model
0                 300         CHRYSLER
2  1964 International         Scout 80
3                  AC  AUTOKRAFT MK IV
5               Acura               CL
6               Acura               CL

In [9]:
top_20_makes = ModelandMake_df['Make'].value_counts().head(20)
print(top_20_makes)

Make
Ford             22025
Chevrolet        21171
Toyota            6676
Mercedes-Benz     6240
Dodge             5896
BMW               5128
Jeep              4543
Cadillac          3656
Volkswagen        3589
Honda             3448
Pontiac           2711
GMC               2535
Nissan            2507
Porsche           2228
Lincoln           1860
Buick             1817
Audi              1520
Chrysler          1486
Jaguar            1322
Subaru            1311
Name: count, dtype: int64

In [10]:
top_20_makes = ModelandMake_df['Make'].value_counts().head(20).index
ModelandMake_df = ModelandMake_df[ModelandMake_df['Make'].isin(top_20_makes)]

In [11]:
ModelandMake_df.head()

      Make Model
1370  Audi    80
1371  Audi    90
1372  Audi    90
1373  Audi    90
1374  Audi    90

In [12]:
top_makes = ModelandMake_df['Make'].value_counts().head(20)
top_makes

Make
Ford             22025
Chevrolet        21171
Toyota            6676
Mercedes-Benz     6240
Dodge             5896
BMW               5128
Jeep              4543
Cadillac          3656
Volkswagen        3589
Honda             3448
Pontiac           2711
GMC               2535
Nissan            2507
Porsche           2228
Lincoln           1860
Buick             1817
Audi              1520
Chrysler          1486
Jaguar            1322
Subaru            1311
Name: count, dtype: int64

In [32]:
ModelandMake_df.to_csv('DataBase.csv', index=False)

In [15]:
ModelandMake_df.to_json('DataBase.json', orient='split')